import jieba
import matplotlib.pyplot as plt
import os
from wordcloud import WordCloud

font_path = './font.ttf'
text = " ".join(["檸檬魚","綠咖喱飯", "油飯","米粉", "壽司", "鯖魚便當","匈牙利雞腿飯","杏鮑菇牛肉飯","素食便當", "小排","紅燒魚", "櫻花蝦炒飯","松露炒飯", "炙燒鮭魚丼", "油雞便當", "青發炒飯","蔥油餅","牛肉捲餅","燙青菜","小米粥", "綠咖哩雞肉飯","嫩煎里肌肉飯", "匈牙利雞","照燒鮭魚", "香菇雞飯","鯖魚飯", "糖醋里肌飯","野菜雞肉烏龍麵", "洋蔥蘋果雞腿飯","照燒鮭魚飯", "三杯雞腿飯","香煎白帶魚飯", "蒜泥白肉飯","紅燒赤鯮魚", "雞肉咖哩飯","厚切豬排咖哩飯","麻花肉桂捲", "樹子蒸魚鱈","什錦蔬食炒飯", "炙燒鮭魚丼","鯖魚丼", "小排","紅燒魚", "嫩雞肉咖哩","慢燉豬軟骨咖哩", "小排","紅燒魚", "樹子蒸魚鱈","櫻花鮭魚炒飯", "壽司","沙拉卷", "蔬菜咖哩","素雞咖哩", "小排","紅燒魚", "雞咖哩","紅燒牛肉咖哩", "油飯","米粉","蘿蔔糕", "鱈魚便當","飯糰", "小排","紅燒魚"])

wc = WordCloud(background_color='white', font_path=font_path)
wc.generate(text)
plt.imshow(wc)
plt.axis("off")
plt.show()
